app/controllers/secret_messages_controller.rb

SELECT * FROM "secret_messages"
---
  def index
    @secret_messages = SecretMessage.all